#ifndef COMMAND_HPP
# define COMMAND_HPP

// ------------------------------------------------
// include
// ------------------------------------------------

#include <iostream>
#include "irc.hpp"

// ------------------------------------------------
// struct
// ------------------------------------------------


// ------------------------------------------------
// class
// ------------------------------------------------

class Command {
	public:
		Command();
		virtual ~Command() = 0;//純粋仮想関数

		virtual const t_response	execute(const t_parserd& input) const = 0; //純粋仮想関数
};

// ------------------------------------------------
// function
// ------------------------------------------------


#endif
